# HorizontalCurveEndpoint Properties

---
The HorizontalCurveEndpoint type exposes the following members.
| Name| Description
---|---|---
| NextCurveType|  The HorizontalCurveType of the curve which connects the endpoint to the next displayed curve. If this endpoint's Station equals DisplayedEndStation, returns Unknown curve type.
| PreviousCurveType|  The HorizontalCurveType of the curve which connects the endpoint to the previous displayed curve. If this endpoint's Station equals DisplayedStartStation, returns Unknown curve type.
| Station|  The endpoint's station value.
Top
#### Reference
HorizontalCurveEndpoint Class
Autodesk.Revit.DB.Infrastructure Namespace